Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Executando terraform plan


Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_launch_configuration.ubuntu_20_04 has changed
~ resource "aws_launch_configuration" "ubuntu_20_04" {
        id                               = "atlantis_ecs"
        name                             = "atlantis_ecs"
      + security_groups                  = []
      + vpc_classic_link_security_groups = []
        # (6 unchanged attributes hidden)
    }

  # aws_lb_listener.front_end has changed
~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:398963803929:listener/app/lb-ecs/1ba5a14d83255d1b/eca30d51e0f93cf6"
      + tags              = {}
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.tg_ecs has changed
~ resource "aws_lb_target_group" "tg_ecs" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
        name                               = "tg-ecs"
      + tags                               = {}
        # (14 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_placement_group.atlantis_ecs has changed
~ resource "aws_placement_group" "atlantis_ecs" {
        id                 = "test"
        name               = "test"
      + tags               = {}
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_autoscaling_attachment.asg_attachment_bar will be created
+ resource "aws_autoscaling_attachment" "asg_attachment_bar" {
      + alb_target_group_arn   = "arn:aws:elasticloadbalancing:us-east-2:398963803929:targetgroup/tg-ecs/8248864adeb13723"
      + autoscaling_group_name = (known after apply)
      + id                     = (known after apply)
    }

  # aws_autoscaling_group.atlantis_ecs will be created
+ resource "aws_autoscaling_group" "atlantis_ecs" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = true
      + force_delete_warm_pool    = false
      + health_check_grace_period = 1
      + health_check_type         = "ELB"
      + id                        = (known after apply)
      + launch_configuration      = "atlantis_ecs"
      + max_size                  = 1
      + metrics_granularity       = "1Minute"
      + min_size                  = 1
      + name                      = "atlantis_ecs"
      + name_prefix               = (known after apply)
      + placement_group           = "test"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-01eb577852a061ca1",
          + "subnet-0b8ec0c0cc65e83fe",
          + "subnet-0e5e136aa686c7336",
        ]
      + wait_for_capacity_timeout = "10m"

      + tag {
          + key                 = "Env"
          + propagate_at_launch = false
          + value               = "teste"
        }
      + tag {
          + key                 = "foo"
          + propagate_at_launch = true
          + value               = "bar"
        }

      + timeouts {
          + delete = "15m"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.


```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://66992d035d8e:4141/lock?id=Matheus-SCosta%252FATLANTIS-ECS%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
